app/Controllers/cart_controller.php

    public function catalogo(){
        $session=session();
        $dato = array('titulo' => 'Todos los Productos');
        $producto_model = new producto_model();
        $data['productos'] = $producto_model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `productos`
ORDER BY `id` DESC