app/Controllers/login_controller.php

SELECT *
FROM `usuarios`
WHERE `usuario` = 'jez'
 LIMIT 1
---
 	public function auth(){
       		$session= session(); //El objeto de sesión se asigna a la variable session
       		$model= new usuario_Model(); //se instancia el modelo


       	//traemos los datos del formulario, para ingresar pedirá nombre de usuario y contraseña
       	$usuario = $this->request->getVar('usuario');
       	$password= $this->request->getVar('pass');



          $data= $model->where('usuario', $usuario)->first();   //consulta SQL en base al nombre de usuarios