app/Controllers/producto_controller.php

            $img->move(ROOTPATH . 'assets/uploads', $nombre_aleatorio);

            $productoModel = new Producto_Model();
            $productoModel->save([
                'nombre_prod' => $this->request->getVar('nombre_prod'),
                'imagen' => $nombre_aleatorio,
                'categoria_id' => $this->request->getVar('categoria'),
                'precio' => $this->request->getVar('precio'),
                'precio_vta' => $this->request->getVar('precio_vta'),
                'stock' => $this->request->getVar('stock'),
                'stock_min' => $this->request->getVar('stock_min'),
            ]);
---
INSERT INTO `productos` (`nombre_prod`, `imagen`, `categoria_id`, `precio`, `precio_vta`, `stock`, `stock_min`) VALUES ('Air Pods Azul', '1718340766_65506557780f76513f01.jpg', '1', '50000', '50000', '4', '12')