app/Controllers/venta_controller.php

SELECT *
FROM `ventas_cabecera`
SELECT *
FROM `ventas_detalle`
WHERE `venta_id` = '1'
---
  public function index(){
    $ventasDetalleModel = new ventas_detalle_Model();
    $ventasCabeceraModel = new ventas_cabecera_Model();
    $productoModel = new producto_Model();

    //obtener todos los productos
    $data['productos'] = $productoModel->getProductoAll();

    // Obtener todas las ventas (Cabecera)
    $ventas = $ventasCabeceraModel->findAll();

    // Para cada venta, obtener los detalles
    foreach ($ventas as &$venta) {
        $venta['detalles'] = $ventasDetalleModel->where('venta_id', $venta['id'])->findAll();