app/Models/categoria_Model.php

	public function getCategorias(){
		return $this->findAll();
---
SELECT *
FROM `categorias`