app/Models/producto_Model.php

    public function getventasdetalle($id){
        $this->db->join('productos','productos.id_producto = ventas_detalle.producto_id');
---
SELECT *
FROM `productos`
JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`categoria_id`